# 构造自己的类型与类型类

**对应于Real World Haskell第三章和趣学第8章**

## 定义新的数据类型

1. 使用`data`关键字可以定义新的数据类型

    ```haskell
    data BookInfo = Book Int String [String] deriving (Show) -- [String]表示作者
    ```

    跟在`data`关键字后面的BookInfo就是新类型的名字，BookInfo是类型构造器，Book是值构造器，类型的值由值构造器提供。**类型构造器和值构造器首字母必须大写**。

    跟在值构造器后面的可以视作域（类型的组成部分）

2. 类型构造器只能出现在类型的定义，或者类型签名当中。而值构造器只能出现在实际的代码中。因为存在这种差别，给类型构造器和值构造器赋予一个相同的名字实际上并不会产生任何问题

    `data BookReview = BookReview BookInfo CustomerID String`

3. 类型别名

    ```haskell
    type CustomerID = Int
    type ReviewBody = String
    data BookReview = BookReview BookInfo CustomerID ReviewBody
    type BookRecord = (BookInfo, BookReview)
    ```

    

4. 自定义一个图形类型，可以是圆形或矩形

   ```haskell
   -- Circle的值构造子有三个项(field)，都是Float。类型是Shape。deriving (Show)表示派生于Show，从而可以打印到ghci中
   data Shape = Circle Float Float Float | Rectangle Float Float Float Float deriving (Show)
   -- 注意：这里的项，其实是参数，值构造子的本质是函数，也就是说可以不全调用
   > :t Circle
   Circle :: Float -> Float -> Float -> Shape
   > :t True
   True :: Bool
   ```

   

5. 定义函数计算图形面积

   ```haskell
   area :: Shape -> Float
   area (Circle _ _ r) = pi * r ^ 2
   area (Rectangle x1 y1 x2 y2) = (abs $ x1 - x2) * (abs $ y1 - y2)
   ```

6. 由于值构造子的本质，可以用map来构造同一个圆心，不同半径的圆

   ```haskell
   > map (Circle 3 5) [1,2,3]
   [Circle 3.0 5.0 1.0,Circle 3.0 5.0 2.0,Circle 3.0 5.0 3.0]
   ```

7. 增加Point类型，使Shape更容易理解

   ```haskell
   data Point = Point Float Float deriving(Show)
   data Shape = Circle Point Float | Rectangle Point Point  deriving(Show)
   -- Circle和Rectangle创建的都是SHape类型的值，第一个表达式只有匹配(Circle Point Float)模式才会成功，而第二个表达式只有在匹配 (Rectangle Point Point) 时才会成功
   area :: Shape -> Float
   area (Circle _ r) = pi * r ^ 2
   area (Rectangle (Point x1 y1) (Point x2 y2)) = (abs $ x1 - x2) * (abs $ y1 - y2)
   ```

   

8. 移动图形的函数

   ```haskell
   move :: Shape -> Float -> Float -> Shape
   move (Circle (Point x y) r) a b = Circle (Point (x+a) (y+b)) r
   -- 注意这里的括号，不要被弄得眼花缭乱
   move (Rectangle (Point x1 y1) (Point x2 y2)) a b = Rectangle (Point (x1+a) (y1+b)) (Point(x2+a) (y2+b))
   -- 定义两个辅助函数
   baseCircle :: Float -> Shape
   baseCircle = Circle (Point 0 0)
   baseRectangle :: Float -> Float -> Shape
   baseRectangle x y = Rectangle (Point 0 0) (Point x y)
   > move (baseRectangle 40 100) 60 23
   Rectangle (Point 60.0 23.0) (Point 100.0 123.0)
   ```

   

9. 将这里定义的所有函数和类型都导出到一个模组中

   ```haskell
   module Shapes
   ( Point(..)
   , Shape(..)
   , area
   , move
   , baseCircle
   , baseRectangle
   ) where
   -- 一个Shape (..)，我们就导出了Shape的所有值构造子,这与写Shape(Rectangle,Circle) 等价
   -- 默认是全部导出的吧....如何import不知道
   ```

   

## 记录语法

免费得到了访问器函数，其实是普通的Haskell函数

```haskell
data Car = Car {
	 company :: String, 
	 model :: String, 
	 year :: Int
	 } deriving (Show)

> Car {company="Ford", model="Musting", year=1987}
Car {company = "Ford", model = "Musting", year = 1987}
> Car "Ford" "Musting" 1987
Car {company = "Ford", model = "Musting", year = 1987}
> :t company
company :: Car -> String
```



## 类型构造器中的函数

注意：不要在data声明中加类型约束，只能在函数中添加类型约束

```haskell
data Vector a = Vector a a a deriving (Show)
vplus :: (Num t) => Vector t -> Vector t -> Vector t
(Vector i j k) `vplus` (Vector l m n) = Vector (i+l) (j+m) (k+n)
vectMut :: (Num t) => Vector t -> t -> Vector t
(Vector i j k) `vectMult` m = Vector (i*m) (j*m) (k*m)

> Vector 3 5 8 `vplus` Vector 9 2 8
Vector 12 7 16
> Vector 3 9 7 `vectMult` 10
Vector 30 90 70
```



## Derived instances

所谓类型类，是描述数据类型的行为。若一个类可以判断相等性，则它是Eq类型类的实例，若一个类可以比较大小，则它是Ord类型类的实例

```haskell
-- Nothing是Maybe a的实例。read可以带参数的类型，但必须填满所有的参数
read "Nothing" :: Maybe Int
read "Just 'a'" :: Maybe Char
```

```haskell
data Day = Monday | Tuesday | Wednesday | Thursday | Friday | Sarturday | Sunday deriving (Eq, Ord, Show, Read, Bounded, Enum)

-- 是Eq和Ord类型类的成员
> Sunday == Monday
False
> Sunday > Monday
True

-- 是Show和Read类型类的成员
> show Sunday
"Sunday"
> read "Friday" :: Day
Friday

-- 是Bounded类型类的成员
> minBound :: Day
Monday

-- 是Enum类型类的成员
> [Thursday .. ] -- 必须要有空格，不然报错，而[1..]却是正确的
[Thursday,Friday,Sarturday,Sunday]
```



## 递归类型

1. 自定义List，用`Cons`代替`:`，用`Nil`代替`[]`构造器。当我们使用 `Cons` 构造器创建一个值的时候，我们必须提供一个 `a` 的值作为参数一，以及一个 `List a` 类型的值作为参数二

   ```haskell
   data List a = Cons a (List a)
               | Nil
                 deriving (Show)
   
   ghci> Cons 0 Nil
   Cons 0 Nil
   ghci> Cons 1 it
   Cons 1 (Cons 0 Nil)
   ghci> Cons 2 it
   Cons 2 (Cons 1 (Cons 0 Nil))
   
   -- List可以被当作是list吗？
   fromList (x:xs) = Cons x (fromList xs)
   fromList []     = Nil
   ghci> fromList "abc"
   Cons 'a' (Cons 'b' (Cons 'c' Nil))
   ```

   练习：请给 `List` 类型写一个与 `fromList` 作用相反的函数：传入一个 `List a` 类型的值，返回一个 `[a]`。

   ```haskell
   toList :: List a -> [a]
   toList (Cons x y) = x:(toList y)
   toList _ = []
   ghci> let a = Cons 2 $ Cons 1 $ Cons 0 Nil
   ghci> toList a
   [2,1,0]
   ```

   

2. 定义Tree

   ```haskell
   data Tree a = Node a (Tree a) (Tree a)
                 | Empty
                 deriving (Show)
   
   simpleTree = Node "parent" (Node "left child" Empty Empty)
                              (Node "right child" Empty Empty)
   ```

   **练习：请仿造 Java 示例，定义一种只需要一个构造器的树类型。不要使用 `Empty` 构造器，而是用 `Maybe` 表示节点的子节点**

   

## 类型类定义

`class`关键字